cache/stories/agenda.html
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Absicht</a>
<ul>
<li><a href="#sec-1-1">Misha Verbitsky's Programme</a>
<ul>
<li><a href="#sec-1-1-1">Metric Geometry and Topology</a></li>
<li><a href="#sec-1-1-2">Linear and Basic Algebra</a></li>
<li><a href="#sec-1-1-3">Real Analysis</a></li>
<li><a href="#sec-1-1-4">Logic and Discrete Mathematics</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-2">Analysis</a>
<ul>
<li><a href="#sec-2-1">Harvard Math 55b</a></li>
<li><a href="#sec-2-2">MIT</a></li>
<li><a href="#sec-2-3">HSE</a></li>
</ul>
</li>
<li><a href="#sec-3">Linear Algebra</a>
<ul>
<li><a href="#sec-3-1">Harvard Math 55a</a></li>
<li><a href="#sec-3-2">MIT 18.700: Linear Algebra</a></li>
<li><a href="#sec-3-3">MIT 18.701: Algebra I</a></li>
<li><a href="#sec-3-4">HSE</a></li>
</ul>
</li>
<li><a href="#sec-4">Geometry</a>
<ul>
<li><a href="#sec-4-1">HSE</a></li>
</ul>
</li>
<li><a href="#sec-5">Miscellaneous</a>
<ul>
<li><a href="#sec-5-1">Yufei Zhao's olympiad training handouts</a></li>
<li><a href="#sec-5-2">Alexander Remorov's Math Competition Handouts</a></li>
<li><a href="#sec-5-3">Po-Shen Loh's Math Olympiad teaching notes</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Absicht</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><a href="../assets/agenda/verbit_programme.txt">Misha Verbitsky's Programme</a></h3>
<div class="outline-text-3" id="text-1-1">
</div><div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1">Metric Geometry and Topology</h4>
<div class="outline-text-4" id="text-1-1-1">
<hr  />
<p>
Литература.
</p>
<hr  />

<p>
<i>cf. <a href="http://bogomolov-lab.ru/KURSY/TOP-2012/">HSΕ 2012 Course in Topology</a></i>
</p>

<ul class="org-ul">
<li><a href="http://www.pdmi.ras.ru/~olegviro/topoman/e-unstable.pdf">Elementary Topology. Textbook in Problems by O.Ya.Viro, O.A.Ivanov, V.M.Kharlamov, N.Y.Netsvetaev</a>
</li>
<li><a href="http://verbit.ru/MATH/UCHEBNIK/top-book.pdf">Вербицкий М., Топология в задачах</a>
</li>
<li><a href="http://www.math.psu.edu/petrunin/papers/alexandrov/bbi.pdf">Бураго Д. Ю., Бураго Ю. Д, Иванов С. В. A Course in Metric Geometry </a>
</li>
<li>Misha Gromov. Metric structures for Riemannian and non-Riemannian spaces
</li>
</ul>

<pre class="example">
А. Пополнение и вещественные числа
(на анализе можно дать аксиоматическое определение,
а тут заставить студентов все проверять, либо наоборот).
Последовательности Коши. Полнота.

Б. Метрические пространства. Норма в векторных
   пространствах. Приведение скалярного произведения
   к диагональному виду. Неравенство
   Коши-Буняковского-Шварца. Метрика на R^n.
   Эквивалентность норм. Нормированные кольца и поля.

В.  Пополнение. P-адические числа. *Теорема Островского.

Г. Компакты. Теорема Гейне-Бореля (секвенциональная
компактность в метрическом пространстве эквивалентна
обычной). Геодезические. *Теорема Хопфа-Ринова (локальная
компактность в полном метрическом пространстве равносильна
существованию геодезических). Внутренние метрики.

Д. Основы общей топологии. Дискретная, кодискретная
топология, аксиомы Хаусдорфа, аксиомы счетности,
экзотические примеры топологических
пространств. Сходимость последовательностей в
топологических пространствах. Гомеоморфизм, замыкание,
всюду плотные множества.

Е. Произведение топологических пространств. Топология
произведения и топология на R^n. Гильбертов
куб. Лемма Урысона (о существовании непрерывных функций
на хаусдорфовых нормальных пространствах). *Теорема о метризуемости
(хаусдорфово пространство со счетной базой метризуемо и
допускает вложение в гильбертов куб).
</pre>
</div>
</div>

<div id="outline-container-sec-1-1-2" class="outline-4">
<h4 id="sec-1-1-2">Linear and Basic Algebra</h4>
<div class="outline-text-4" id="text-1-1-2">
<hr  />
<p>
Литература.
</p>
<hr  />
<ul class="org-ul">
<li>А. Шень. Простые и составные числа
</li>
<li>И. Л. Кантор, А. С. Солодовников. Гиперкомплексные числа.
</li>
<li>И. М. Гельфанд, А. Шень. Алгебра.
</li>
<li><a href="http://www.mccme.ru/free-books/pdf/alekseev.pdf">В. Б. Алексеев. Теорема Абеля в задачах и решениях.</a>
</li>
<li>М. М. Постников. Введение в теорию алгебраических чисел.
</li>
<li>И. Р. Шафаревич. Основные понятия алгебры.
</li>
<li>А. А. Кириллов. Что такое число?
</li>
<li>А. И. Кострикин, Ю. И. Манин, Линейная алгебра и геометрия.
</li>
<li>М.М. Постников. Лекции по геометрии. Линейная алгебра
</li>
<li>S. Axler. "Linear algebra done Right"
</li>
</ul>

<pre class="example">
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

А. Группы, кольца, поля. Группа перестановок.
Аксиоматическое определение вещественных чисел.
Комплексные числа, сопряжение, модуль, деление
комплексных чисел.

Б. Действие группы на множестве. Гомоморфизм.
Каждая группа вкладывается в группу перестановок.
Нормальные подгруппы, диэдральная группа, симметрическая
группа, четверная группа Клейна, полупрямое произведение,
центральное расширение.

В. Делимость и алгоритм Евклида. Разложение на простые
множители. Идеалы, гауссовы числа, факториальные кольца, кольца
главных идеалов. Гомоморфизм колец, факторкольцо.
Неоднозначность разложения на простые в числовых
кольцах (примеры).

Г. Векторное пространство. Базис, размерность, линейная
независимость, тензорное произведение. Линейные операторы.
Алгебраические числа, иррациональные числа, трансцендентные числа.
Сумма, произведение, частное алгебраических чисел
алгебраично.

Д. Линейные формы, билинейные формы, полилинейные
формы, тензорное произведение. Двойственность и
ее свойства. Симплектические, евклидовы векторные пространства
и их группы автоморфизмов. Ортонормированный
базис, симплектический базис. Сигнатура квадратичной формы.

Е. Алгебры над
полем. Гиперкомплексные числа, кватернионы,
полиномы, алгебра Грассмана. Алгебры, заданные
образующими и соотношениями. Алгебра Клиффорда.

Ж. Алгебра Грассмана (подсчет размерности компонент).
Алгебра Грассмана (определитель). Мультипликативность
определителя. Тензорное произведение
алгебр. Алгебра Грассмана от суммы двух пространств.
Базис в алгебре Грассмана, явное выражение для
определителя. Матрица как способ записи линейного
оператора. Ранг матрицы. Обращение матриц
(явная формула). Определитель ортогональной
матрицы. Определитель симплектической матрицы.
Пфаффиан. Определитель Вандермонда.

З. Собственные значения и собственные векторы.
Приведение оператора к верхнетреугольной форме;
приведение коммутирующих операторов к верхнетреугольной
форме в одном и том же базисе.
</pre>
</div>
</div>

<div id="outline-container-sec-1-1-3" class="outline-4">
<h4 id="sec-1-1-3">Real Analysis</h4>
<div class="outline-text-4" id="text-1-1-3">
<hr  />
<p>
Литература:
</p>
<hr  />

<ul class="org-ul">
<li>Лоран Шварц. Анализ.
</li>
<li>В. А. Зорич. Математический анализ.
</li>
<li>У. Рудин. Основы математического анализа.
</li>
<li>Б. Гелбаум, Дж. Олмстед. Контрпримеры в анализe.
</li>
<li>Зельдович Я.Б., Яглом И.М. Высшая математика для начинающих физиков и техников.
</li>
<li>С. И. Шварцбурд, О. С. Ивашев-Мусатов. Алгебра и начала
анализа. Учебное пособие для ПТУ.
</li>
<li>C. Pugh. Real Mathematical Analysis

<pre class="example">
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

А. Предел, сходимость, предельные точки.

Б. Аксиоматическое определение вещественных чисел
(явная конструкция дается в "геометрии"). Сходимость
монотонной последовательности. *Сечение Дедекинда.

В. Сходимость рядов. Критерии сходимости. Степенные ряды.

Г. Абсолютная сходимость. Радиус сходимости ряда.
Умножение рядов. Разложение рациональных функций в степенной ряд.

Д. Непрерывные функции. Теорема о промежуточном значении.
Непрерывность полинома. Решение полиномиальных уравнений
нечетной степени.

Е. Дифференцируемые функции. Производная. Экстремум
функции. Исследование полиномиальных функций на экстремумы.
Явное вычисление производных. Правило Лейбница,
производная композиции, производная частного.
Производная как касательная к графику.

Ж. Правило Лопиталя.  Теорема
Лагранжа о приращении. Теорема Ролля.

З. Разложение функции в ряд Тэйлора. Формула Тэйлора
с остаточным членом. Аналитические функции.

И. Комплексные числа и движения R^2. Явное задание движений
через комплексные числа. Классификация движений.

К. Функции комплексной переменной. Экспонента, синус,
косинус, разложение в синуса и косинуса ряд. Основная теорема алгебры.

Л. Логарифм, разложение логарифма в ряд. Функциональные
тождества для логарифма и экспоненты.

М. Интеграл (наивное определение для непрерывных
функций на прямой). Формула Ньютона-Лейбница.
Интеграл как площадь под графиком.

Н. Символьное интегрирование. Интегралы от рациональных
функций, экспонент, произведения полиномов и экспонент
(с использованием линейных пространств).
</pre>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-1-4" class="outline-4">
<h4 id="sec-1-1-4">Logic and Discrete Mathematics</h4>
<div class="outline-text-4" id="text-1-1-4">
<p>
<i>cf. <a href="http://www.mi.ras.ru/~bekl/logic2014.html">HSΕ 2014/2015 Course in Logic and Algorithms</a></i>
</p>
<hr  />
<p>
Литература.
</p>
<hr  />
<ul class="org-ul">
<li><a href="http://www.mccme.ru/free-books/shen/shen-logic-part1-2.pdf">Н. К. Верещагин, А. Шень. Начала теории множеств.</a>
</li>
<li>Дуглас Р. Хофстадтер. Гедель, Эшер, Бах: эта бесконечная
гирлянда. Метафорическая фуга о разуме и машинах в духе Льюиса
Кэрролла.
</li>
<li>Реймонд Смаллиан. Как же называется эта книга?
</li>
<li>Реймонд Смаллиан. Принцесса или тигр?
</li>
<li>Реймонд Смаллиан. Алиса в стране смекалки
</li>
<li>Мартин Гарднер. Крестики-нолики
</li>
<li>Мартин Гарднер. От мозаик Пенроуза к надёжным шифрам
</li>
<li>Ричард Ф.Фейнман. Вы, конечно, шутите, мистер Фейнман!
</li>
<li>А. Шень. Игры и стратегии с точки зрения математики
</li>
<li>А. Шень. Математическая индукция
</li>
<li>А. Гротендик. Урожаи и посевы.
</li>
<li>В. И. Арнольд. Гюйгенс и Барроу, Ньютон и Гук
</li>
<li>Ю. И. Манин. Математика как метафора.
</li>
<li>Misha Gromov. Ergostuctures, Ergologic and the Universal Learning Problem.
</li>
<li>Г. Харди. Апология математика.
</li>
<li>П. Локхарт. Плач математика.
</li>
<li>М. Кац, С. Улам. Математика и логика.
</li>
<li>А. Шень. Программирование. Теоремы и задачи
</li>
<li>А. Шень. Задачи по математике, предлагавшиеся ученикам
</li>
<li>математического класса 57 школы
</li>
<li>П. С. Александров, А. И. Маркушевич, А. Я. Хинчин (ред.)
Энциклопедия элементарной математики (6 томов).
</li>
<li>Б. М. Давидович, П. Е. Пушкарь, Ю. В. Чеканов. Математический анализ
в 57-й школе. Четырехгодичный курс
</li>
<li>Барвейс (ред.) Справочная книга по математической логике
</li>
</ul>

<pre class="example">
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

А. Формальный метод Гильберта: системы аксиом евклидовой
геометрии от Евклида до Гильберта и Колмогорова.

Б. Простейшие аксиоматические структуры. Кванторы.
Исчисление высказываний.

В. Множества, функции. Соотношения эквивалентности и порядка.
Аксиомы Пеано и метод математической индукции.

Г. Счетные множества, несчетные множества.
Диагональный метод Кантора и парадоксы наивной теории множеств.

Д. Формальная теория множеств (обзор).
Теорема Кантора-Бернштейна. Континуум-гипотеза.

Е. Аксиома выбора, ординалы, теорема Цермело,
лемма Цорна.

Ж. Основы комбинаторики. Отображения конечных множеств.
Принцип Дирихле и биномиальные коэффициенты. Треугольник
Паскаля.

З. Степенные ряды и производящие функции. Числа Фибоначчи.

И. Треугольные числа. Разбиения и перестановки. Рекуррентные соотношения.
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Analysis</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">Harvard Math 55b</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li><a href="http://www.math.harvard.edu/~elkies/M55b.10/">Spring 2010 :elkies</a>
</li>
<li><a href="http://www.math.harvard.edu/~ctm/home/text/class/harvard/55b/10/html/">Spring 2010 :ctm </a>
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2">MIT</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li><a href="https://ocw.mit.edu/courses/mathematics/18-100b-analysis-i-fall-2010/index.htm">MIT 18.100B</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3">HSE</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li><a href="https://math.hse.ru/calculus2016">HSE Analysis I</a>
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Linear Algebra</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1">Harvard Math 55a</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li><a href="http://www.math.harvard.edu/~ctm/home/text/class/harvard/55a/08/html/">Fall 2008</a>
</li>
<li><a href="http://www.math.harvard.edu/~ctm/home/text/class/harvard/55a/09/html/index.html">Fall 2009</a>
</li>
<li><a href="http://www.math.harvard.edu/~elkies/M55a.10/">Fall 2010</a>
</li>
<li><a href="http://www.math.harvard.edu/~elkies/M55a.16/index.html">Fall 2016</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2">MIT 18.700: Linear Algebra</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li><a href="http://www-math.mit.edu/~dav/700.html">Fall 2014</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3">MIT 18.701: Algebra I</h3>
<div class="outline-text-3" id="text-3-3">
<ul class="org-ul">
<li><a href="http://math.mit.edu/classes/18.701/index.html">Fall 2016</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4">HSE</h3>
<div class="outline-text-3" id="text-3-4">
<ul class="org-ul">
<li><a href="https://sites.google.com/site/akhoroshkin/home/algebra_1_2016">HSE Algebra I</a>
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Geometry</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1">HSE</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li><a href="https://math.hse.ru/geometry2016">HSE Geometry I</a>
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">Miscellaneous</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><a href="http://yufeizhao.com/olympiad.html">Yufei Zhao's olympiad training handouts</a></h3>
</div>

<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><a href="http://www.mit.edu/~alexrem/Math%2520Competitions.html">Alexander Remorov's Math Competition Handouts</a></h3>
</div>

<div id="outline-container-sec-5-3" class="outline-3">
<h3 id="sec-5-3"><a href="http://math.cmu.edu/~ploh/olympiad.shtml">Po-Shen Loh's Math Olympiad teaching notes</a></h3>
<div class="outline-text-3" id="text-5-3">
<ul class="org-ul">
<li><a href="http://math.cmu.edu/~ploh/docs/math/mop2011/prob-method.pdf">Probabilistic Methods in Combinatorics 2011</a>
</li>
<li><a href="http://math.cmu.edu/~ploh/docs/math/mop2012/combinatorics-black-soln.pdf">Probabilistic Methods in Combinatorics 2012</a>
</li>
</ul>
</div>
</div>
</div>
